hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/modem.c
float markFreq;
float spaceFreq;
float baudRate;

static uint32_t markStep;  // Q32 phase increment per DAC sample
static uint32_t spaceStep; // Q32 phase increment per DAC sample
static uint16_t baudRateStep;
static float txRateHz; // real DAC alarm rate every transmit step is built from

// Receive tuning stored by ModemSetRxTuning() and read by ModemInit().
static modem_rx_tuning_t rxTuning = MODEM_RX_TUNING_DEFAULT();
static int16_t coeffHiI[NMAX], coeffLoI[NMAX], coeffHiQ[NMAX], coeffLoQ[NMAX];
// Data Carrier Detect, as a bitmap: bit i is set while demodulator i has its
// PLL locked. Consumers that only need "is the channel busy" test it for
// non-zero, which stays correct whatever the demodulator count is; the loop
// test in main/aprs_service.c reports the bits so an operator can tell which
// of the parallel demodulators locked.
static uint8_t dcd = 0;

// G3RUH scrambler state. TX and RX must have one each.
//
// A single shared register would be enough for a half duplex node, which never
// scrambles and descrambles at the same moment. It is fatal in full duplex -
// the only mode the loopback self test can run in - because the DAC ISR
// advances the register once per transmitted symbol while the RX task advances
// it once per received symbol, from the same variable, and neither side then
// holds the sequence it needs. They are logically two independent shift
// registers, so they are two variables.
static uint32_t txLfsr = 0x1FFFF;
static uint32_t rxLfsr = 0x1FFFF;

// Fixed 8-tap prefilters of the MODEM_RX_EQ_LEGACY demodulator set, fs=9600,
// gain 32768. Both carry an asymmetric last tap and are not linear phase.
//
// bpf1200Tilted: -6.5 dB at 1200 Hz, +3.0 dB at 2200 Hz - the space tone gains
// 9.5 dB on the mark tone. Used on de-emphasized (speaker) audio.
static const int16_t bpf1200Tilted[8] = { 728, -13418, -554, 19493, -554, -13418, 728, 2104 };

// bpf1200Level: +4.2 dB at 1200 Hz, +4.4 dB at 2200 Hz, peak +6.1 dB at
// 1700 Hz, -17 dB at 300 Hz and -22 dB at 3500 Hz - a band-pass with equal
// gain at both tones. Used on flat (discriminator) audio.
static const int16_t bpf1200Level[8] = { -10513, -10854, 9589, 23884, 9589, -10854, -10513, -879 };

// fs=9600, rectangular, fc1=1500, fc2=1900, 0 dB @ 1600/1800 Hz, N=15, gain 65536
static const int16_t bpf300[15] = {
    186, 8887, 8184, -1662, -10171, -8509, 386, 5394, 386, -8509, -10171, -1662, 8184, 8887, 186,
};

// Longest prefilter a demodulator can hold: the runtime-designed ones are
// bounded by MODEM_RX_BPF_TAPS_MAX, bpf300 is 15 taps.
#define BPF_MAX_TAPS MODEM_RX_BPF_TAPS_MAX
_Static_assert(BPF_MAX_TAPS >= 15, "BPF_MAX_TAPS must hold bpf300");

// fs=9600 Hz, raised cosine, fc=300 Hz (BR=600 Bd), beta=0.8, N=14, gain=65536
static const int16_t lpf300[14] = {
    4385, 4515, 4627, 4720, 4793, 4846, 4878, 4878, 4846, 4793, 4720, 4627, 4515, 4385,
};

static const int16_t lpf1200[15] = {
    -6128, -5974, -2503, 4125, 12679, 21152, 27364, 29643, 27364, 21152, 12679, 4125, -2503, -5974, -6128,
};

// fs=76800 Hz, Gaussian, fc ~5000 Hz (-3 dB at 0.53 x baud), N=15, gain=65536.
//
// The width of this filter is chosen for the sample rate it actually runs at.
// With 8 samples per symbol a Gaussian whose impulse response is long relative
// to one symbol costs real intersymbol interference, so sigma cannot simply be
// scaled up with the rate. Host sweep of sigma against worst-case BER over 8
// sampling phases:
//
//      sigma 0.8..2.2  ->  0 errors / 7374 bits
//      sigma 2.4       ->  6
//      sigma 2.6       -> 12
//      sigma 2.8..3.0  -> 18
//
// sigma 2.0 is taken: mid-range, so there is margin on the ISI side, while
// -3 dB at ~5 kHz is a defensible noise bandwidth for 9600 Bd on air rather than
// merely whatever passes a noiseless loopback.
static const int16_t lpf9600[15] = {
    29, 145, 574, 1769, 4245, 7930, 11538, 13076, 11538, 7930, 4245, 1769, 574, 145, 29,
};

#define LPF_MAX_TAPS    15
#define FILTER_MAX_TAPS ((LPF_MAX_TAPS > BPF_MAX_TAPS) ? LPF_MAX_TAPS : BPF_MAX_TAPS)

struct Filter {
    const int16_t *coeffs;
    uint8_t taps;
    int32_t samples[FILTER_MAX_TAPS];
    uint8_t idx; // index of the newest sample in the circular samples[] buffer
    uint8_t gainShift;
};

struct DemodState {
    uint8_t rawSymbols;  // raw, unsynchronized symbols
    uint8_t syncSymbols; // synchronized symbols

    enum ModemPrefilter prefilter;
    struct Filter bpf;
    int16_t bpfTable[BPF_MAX_TAPS]; // storage for a prefilter designed by ModemInit()
    float bpfTiltDb;                // prefilter gain at the space tone minus gain at the mark tone

    // Correlator level of the mark tone while the demodulator decides "mark",
    // and of the space tone while it decides "space": first-order averages
    // with a time constant of 64 samples (eight symbols at 1200 Bd), read by
    // ModemGetTwistDb().
    int32_t markLevel;
    int32_t spaceLevel;

    int16_t correlatorSamples[NMAX];
    uint8_t correlatorSamplesIdx;
    struct Filter lpf;

    uint8_t dcd;

    int32_t pll;
    int32_t pllStep;
    int32_t pllLockedTune;
    int32_t pllNotLockedTune;

    int32_t dcdPll;
    uint8_t dcdLastSymbol;
    uint16_t dcdCounter;
    uint16_t dcdMax;
    uint16_t dcdThres;
    uint16_t dcdInc;
    uint16_t dcdDec;
    int32_t dcdTune;

    int16_t peak;
    int16_t valley;
};

static struct DemodState demodState[MODEM_MAX_DEMODULATOR_COUNT];

static void decode(uint8_t symbol, uint8_t demod, uint16_t mV);
static int32_t demodulate(int16_t sample, struct DemodState *dem);

static int32_t filterRun(struct Filter *f, int32_t input) {
    // An unconfigured filter (taps == 0) has no coefficients to run against.
    // Without this guard, f->taps - 1 wraps to 255 and the code below
    // indexes far past the end of samples[].
    if (f->taps == 0)
        return 0;

    // Circular buffer: the newest sample overwrites the oldest one in place
    // instead of shifting every other sample down by one on every call.
    if (f->idx == 0)
        f->idx = f->taps;
    f->idx--;
    f->samples[f->idx] = input;

    int32_t out = 0;
    uint8_t idx = f->idx;
    for (uint8_t i = 0; i < f->taps; i++) {
        out += (int32_t)f->coeffs[i] * f->samples[idx];
        if (++idx == f->taps)
            idx = 0;
    }

    return out >> f->gainShift;
}

float ModemGetBaudrate(void) {
    return baudRate;
}

uint8_t ModemGetDemodulatorCount(void) {
    return demodCount;
}

uint8_t ModemDcdState(void) {
    return dcd;
}

void ModemGetSignalLevel(uint8_t modem, int8_t *peak, int8_t *valley, uint8_t *level) {
    // Public component API: the index is bounded against the demodState array
    // here rather than trusted, so a caller outside the component cannot read
    // past it. An out-of-range demodulator reports a flat, silent channel.
    if (modem >= MODEM_MAX_DEMODULATOR_COUNT) {
        *peak = 0;
        *valley = 0;
        *level = 0;
        return;
    }

    *peak = (int8_t)((100 * (int32_t)demodState[modem].peak) >> 12);
    *valley = (int8_t)((100 * (int32_t)demodState[modem].valley) >> 12);
    *level = (uint8_t)((100 * (int32_t)(demodState[modem].peak - demodState[modem].valley)) >> 13);
}

enum ModemPrefilter ModemGetFilterType(uint8_t modem) {
    // Same bound as ModemGetSignalLevel(): an out-of-range demodulator reports
    // PREFILTER_NONE, the value that makes the pre-filter path a no-op.
    if (modem >= MODEM_MAX_DEMODULATOR_COUNT)
        return PREFILTER_NONE;

    return demodState[modem].prefilter;
}

float ModemGetFilterTiltDb(uint8_t modem) {
    if (modem >= MODEM_MAX_DEMODULATOR_COUNT || demodState[modem].prefilter == PREFILTER_NONE)
        return 0.0f;

