hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/modem.c
    return demodState[modem].bpfTiltDb;
}

int8_t ModemGetTwistDb(uint8_t modem) {
    if (modem >= MODEM_MAX_DEMODULATOR_COUNT || ModemConfig.modem == MODEM_MODEM_G3RUH)
        return 0;

    int32_t mark = demodState[modem].markLevel;
    int32_t space = demodState[modem].spaceLevel;
    if (mark <= 0 || space <= 0)
        return 0;

    float db = 20.0f * log10f((float)space / (float)mark) - ModemGetFilterTiltDb(modem);
    if (db > 30.0f)
        db = 30.0f;
    else if (db < -30.0f)
        db = -30.0f;
    return (int8_t)lrintf(db);
}

void ModemSetRxTuning(const modem_rx_tuning_t *t) {
    if (t == NULL)
        return;

    rxTuning = *t;
    modem_rx_tuning_sanitize(&rxTuning);
}

static void setDcd(bool state) {
    if (state)
        LED_Status2(0, 255, 0);
    else
        LED_Status2(0, 0, 0);
}

static inline uint8_t descramble(uint8_t in) {
    // G3RUH descrambling (x^17+x^12+1). Self synchronising: the register only
    // has to see 17 symbols of any signal to be in step, so no init handshake
    // is needed and the initial value below does not matter.
    uint8_t bit = (uint8_t)(((rxLfsr & 0x10000) > 0) ^ ((rxLfsr & 0x800) > 0) ^ (in > 0));

    rxLfsr <<= 1;
    rxLfsr |= in;
    return bit;
}

// IRAM_ATTR: called from MODEM_BAUDRATE_TIMER_HANDLER() (DAC GPTimer ISR)
// whenever ModemConfig.modem == MODEM_MODEM_G3RUH. Same -Og inlining risk as
// dac_scale()/sinSample() above - "static inline" is not a guarantee, and an
// un-inlined static function defaults to flash. This one is gated on exactly
// the G3RUH path, which is why it can look like a 9600-only problem while
// 1200 Bd profiles never call it and never show the jitter. descramble()
// does not need this: it only runs from decode(), which executes in
// afsk_rx_task task context, not at interrupt level.
static inline uint8_t IRAM_ATTR scramble(uint8_t in) {
    // G3RUH scrambling (x^17+x^12+1)
    uint8_t bit = (uint8_t)(((txLfsr & 0x10000) > 0) ^ ((txLfsr & 0x800) > 0) ^ (in > 0));

    txLfsr <<= 1;
    txLfsr |= bit;
    return bit;
}

void MODEM_DECODE(int16_t sample, uint16_t mVrms) {
    uint8_t dcdBits = 0;

    for (uint8_t i = 0; i < demodCount; i++) {
        uint8_t symbol = (demodulate(sample, &demodState[i]) > 0);

        decode(symbol, i, mVrms);
        if (demodState[i].dcd)
            dcdBits |= (uint8_t)(1u << i);
    }

    // The status LED and the busy-channel test both mean "any demodulator
    // locked", so they key off the bitmap being non-zero.
    setDcd(dcdBits != 0);
    dcd = dcdBits;
}

// Modulator state. Runs in the GPTimer ISR at the configured DAC sample rate.
//
// Symbol timing differs between the two kinds of profile.
//
// The AFSK profiles advance a Q32 symbol-phase accumulator by
// baud * 2^32 / (real DAC alarm rate) per DAC sample and start a new symbol
// each time it wraps, so the symbol rate is exact whatever the alarm period
// rounds to. A symbol edge lands on the nearest DAC sample - at 1200 Bd that
// is at most 3 % of a symbol, and the tone keeps a continuous phase across
// it, so the receiver never sees it.
//
// G3RUH holds every symbol for exactly baudRateStep DAC samples instead. At
// four samples per symbol a fractional accumulator would move one edge in
// every few hundred by a quarter of a symbol, which is the kind of edge
// jitter this profile cannot absorb. Whole-sample symbols keep every edge on
// the same grid and turn the alarm rounding into a small, uniform rate offset
// the receiving DPLL tracks.
static uint32_t phaseAcc = 0;      // Q32: the full sine cycle is 2^32
static uint32_t baudPhase = 0;     // Q32 symbol phase, AFSK profiles
static uint32_t baudPhaseStep = 0; // Q32 symbol phase increment per DAC sample
static uint16_t sampleIndex = 0;   // DAC samples left in the current symbol, G3RUH
static bool symbolDue = true;      // the next DAC sample starts a new symbol

uint8_t IRAM_ATTR MODEM_BAUDRATE_TIMER_HANDLER(void) {
    uint8_t sinwave = 0;

    if (symbolDue) {
        symbolDue = false;
        if (Ax25GetTxBit() == 0) // next bit is 0 -> change symbol (NRZI)
            currentSymbol ^= 1;

        // Scramble exactly once per symbol, here, and hold the result for the
        // whole symbol below. The receiver's descrambler is clocked once per
        // symbol, so a scrambler clocked on every DAC sample would produce a
        // sequence it could never match. The other profiles are not
        // scrambled.
        if (ModemConfig.modem == MODEM_MODEM_G3RUH)
            scrambledSymbol = scramble(currentSymbol);
    }

    if (ModemConfig.modem == MODEM_MODEM_G3RUH) {
        sinwave = scrambledSymbol ? 240 : 20;

        if (sampleIndex > 1) {
            sampleIndex--;
        } else {
            sampleIndex = baudRateStep;
            symbolDue = true;
        }
    } else {
        // The phase accumulator is 32 bits wide and the table index is the top
        // 9 of them, with the fraction carried in the low 23 bits. Stepping the
        // table index by an integer instead would quantise the tone to the DAC
        // sample rate over SIN_LEN, i.e. 75 Hz at 38400 - more than 1 % off
        // frequency for every profile. Carrying the fraction, with the step
        // built from the real alarm rate, keeps every tone exact.
        //
        // The index is still 9 bit, so the table lookup truncates the phase -
        // that is amplitude distortion around -54 dBc, already well under the
        // 8-bit DAC's own noise floor.
        if (currentSymbol)
            phaseAcc += spaceStep;
        else
            phaseAcc += markStep;

        sinwave = sinSample((uint16_t)((phaseAcc >> 23) & (SIN_LEN - 1)));

        uint32_t previous = baudPhase;
        baudPhase += baudPhaseStep;
        if (baudPhase < previous)
            symbolDue = true;
    }

    return sinwave;
}

// @brief Demodulate a received sample.
// @param sample Received sample, no more than 13 bits
// @return Current tone (0 or 1)
static int32_t demodulate(int16_t sample, struct DemodState *dem) {
    // input signal amplitude tracking
    if (sample >= dem->peak)
        dem->peak += (int16_t)(((int32_t)(AMP_TRACKING_ATTACK * 32768.f) * (int32_t)(sample - dem->peak)) >> 15);
    else
        dem->peak += (int16_t)(((int32_t)(AMP_TRACKING_DECAY * 32768.f) * (int32_t)(sample - dem->peak)) >> 15);

    if (sample <= dem->valley)
        dem->valley -= (int16_t)(((int32_t)(AMP_TRACKING_ATTACK * 32768.f) * (int32_t)(dem->valley - sample)) >> 15);
    else
        dem->valley -= (int16_t)(((int32_t)(AMP_TRACKING_DECAY * 32768.f) * (int32_t)(dem->valley - sample)) >> 15);

    if (ModemConfig.modem != MODEM_MODEM_G3RUH) {
        if (dem->prefilter != PREFILTER_NONE)
            dem->correlatorSamples[dem->correlatorSamplesIdx] = (int16_t)filterRun(&dem->bpf, sample);
        else
            dem->correlatorSamples[dem->correlatorSamplesIdx] = sample;

        // N is a runtime value (N1200 / N300 / N9600), so "% N" cannot be
        // strength-reduced to a mask by the compiler and would otherwise
        // become a real integer division on every tap. Wrap on compare
        // instead.
        if (++dem->correlatorSamplesIdx == N)
            dem->correlatorSamplesIdx = 0;

