hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/modem.c
        int32_t outLoI = 0, outLoQ = 0, outHiI = 0, outHiQ = 0;
        uint8_t idx = dem->correlatorSamplesIdx;

        for (uint8_t i = 0; i < N; i++) {
            int16_t t = dem->correlatorSamples[idx];
            outLoI += t * coeffLoI[i];
            outLoQ += t * coeffLoQ[i];
            outHiI += t * coeffHiI[i];
            outHiQ += t * coeffHiQ[i];

            if (++idx == N)
                idx = 0;
        }

        outHiI >>= 14;
        outHiQ >>= 14;
        outLoI >>= 14;
        outLoQ >>= 14;

        int32_t lo = abs(outLoI) + abs(outLoQ);
        int32_t hi = abs(outHiI) + abs(outHiQ);

        // Tone levels for the twist estimate: each tone is averaged only while
        // it is the one being received.
        if (lo > hi)
            dem->markLevel += (lo - dem->markLevel) >> 6;
        else
            dem->spaceLevel += (hi - dem->spaceLevel) >> 6;

        sample = (int16_t)(lo - hi);
    }

    // DCD using a "PLL". The PLL runs nominally at the baudrate; its counter
    // counts up and overflows to a minimal negative value, so it crosses zero
    // in the middle. A tone change should happen near this zero crossing.
    // Changes near zero raise the DCD pulse counter and pull the counter phase
    // towards zero; changes far from zero lower it. Above dcdThres we claim the
    // incoming signal is valid. dcdMax keeps the DCD from getting "sticky".
    dem->dcdPll = (int32_t)((uint32_t)(dem->dcdPll) + (uint32_t)(dem->pllStep));

    if ((sample > 0) != dem->dcdLastSymbol) { // tone changed
        if ((uint32_t)abs(dem->dcdPll) < (uint32_t)(dem->pllStep)) {
            dem->dcdCounter += dem->dcdInc;
            if (dem->dcdCounter > dem->dcdMax)
                dem->dcdCounter = dem->dcdMax;
        } else {
            if (dem->dcdCounter >= dem->dcdDec)
                dem->dcdCounter -= dem->dcdDec;
            else
                dem->dcdCounter = 0;
        }

        dem->dcdPll = (int32_t)(((int64_t)dem->dcdPll * (int64_t)dem->dcdTune) >> PLL_TUNE_BITS);
    }

    dem->dcdLastSymbol = (sample > 0);

    dem->dcd = (dem->dcdCounter > dem->dcdThres) ? 1 : 0;

    // Return the raw value, not just its sign: callers compare against 0
    // anyway, and the magnitude is what the diagnostics need.
    return filterRun(&dem->lpf, sample);
}

// @brief Bit/clock recovery, NRZI decoding, and hand-off to the protocol layer.
static void decode(uint8_t symbol, uint8_t demod, uint16_t mV) {
    struct DemodState *dem = &demodState[demod];

    int32_t previous = dem->pll;

    dem->pll = (int32_t)((uint32_t)(dem->pll) + (uint32_t)(dem->pllStep));

    dem->rawSymbols <<= 1;
    dem->rawSymbols |= (symbol & 1);

    if ((dem->pll < 0) && (previous > 0)) { // PLL overflow: sample the symbol
        dem->syncSymbols <<= 1;

        // take the last three symbols; one is not enough, three work well
        uint8_t sym = dem->rawSymbols & 0x07;
        if (sym == 0x07 || sym == 0x06 || sym == 0x05 || sym == 0x03)
            sym = 1;
        else
            sym = 0;

        if (ModemConfig.modem == MODEM_MODEM_G3RUH)
            sym = descramble(sym);

        dem->syncSymbols |= sym;

        // NRZI decoding: no transition -> 1, transition -> 0
        if (((dem->syncSymbols & 0x03) == 0x03) || ((dem->syncSymbols & 0x03) == 0x00))
            Ax25BitParse(1, demod, mV);
        else
            Ax25BitParse(0, demod, mV);
    }

    if (((dem->rawSymbols & 0x03) == 0x02) || ((dem->rawSymbols & 0x03) == 0x01)) {
        if (!dem->dcd) // PLL not locked - adjust faster
            dem->pll = (int32_t)(((int64_t)dem->pll * (int64_t)dem->pllNotLockedTune) >> PLL_TUNE_BITS);
        else // PLL locked - adjust slower
            dem->pll = (int32_t)(((int64_t)dem->pll * (int64_t)dem->pllLockedTune) >> PLL_TUNE_BITS);
    }
}

void ModemTransmitStart(void) {
    setPtt(true);
    setTransmit(true);
    ESP_LOGD(TAG, "ModemTransmitStart");
}

// @brief Stop TX and go back to RX.
//
// Called from the DAC timer ISR via Ax25GetTxBit(), so it must be ISR safe:
// it only lowers a flag. AFSK_ServiceTx(), running in the service task, does
// the actual teardown (stop the timer, park the DAC, release PTT).
void IRAM_ATTR ModemTransmitStop(void) {
    setTransmit(false);
}

bool ModemTxTeardownPending(void) {
    return AFSK_TxTeardownPending();
}

void ModemGetStepTones(float *mark, float *space) {
    // Derived from the steps themselves, so this reports what the modulator is
    // really doing rather than what it was asked to do.
    if (mark)
        *mark = (float)(((double)markStep * (double)txRateHz) / 4294967296.0);
    if (space)
        *space = (float)(((double)spaceStep * (double)txRateHz) / 4294967296.0);
}

// Prefilter tilt tables of the designed presets, dB (space gain minus mark
// gain), for flat (discriminator) and de-emphasized (speaker) input. See
// modem_rx_eq_preset_t in esp32idf_radioamateur_modem.h.
static const int8_t tiltSingleFlat[1] = { 0 };
static const int8_t tiltSingleSpeaker[1] = { 3 };
static const int8_t tiltDiv2Flat[2] = { 0, -5 };
static const int8_t tiltDiv2Speaker[2] = { 0, 5 };
static const int8_t tiltDiv3Flat[3] = { 4, 0, -5 };
static const int8_t tiltDiv3Speaker[3] = { 0, 3, 6 };

// Frequency grid of the prefilter designer, points from 0 Hz to fs/2.
#define BPF_DESIGN_GRID 128

// @brief Gain of an FIR, Q15 coefficients, at one frequency.
static float firGain(const int16_t *c, uint8_t taps, float f, float fs) {
    float re = 0.0f, im = 0.0f;
    for (uint8_t n = 0; n < taps; n++) {
        float w = 2.0f * (float)M_PI * f * (float)n / fs;
        re += (float)c[n] * cosf(w);
        im -= (float)c[n] * sinf(w);
    }
    return sqrtf(re * re + im * im) / 32768.0f;
}

// @brief Design a linear-phase band-pass prefilter with a tilt.
//
// Frequency-sampling design on a grid of BPF_DESIGN_GRID + 1 points with a
// Hamming window. The target gain is zero outside [lo, hi] and, inside it,
// varies linearly in dB: 0 dB at markHz, tiltDb at spaceHz. The result is
// scaled so the passband maximum is at most unity, which keeps the int16 cast
// after filterRun() and the post-detection filter's int32 accumulator within
// range for the +-2047 input demodulate() is fed. Runs only from ModemInit(),
// with the receive task held, so the float work here costs nothing in the
// signal path.
static void designPrefilter(int16_t *out, uint8_t taps, float fs, float lo, float hi, float markHz, float spaceHz, float tiltDb) {
    static float target[BPF_DESIGN_GRID + 1];
    float h[BPF_MAX_TAPS];
    const int m = (taps - 1) / 2;

    // Target gain on the grid, trapezoid-rule weights folded in.
    for (int k = 0; k <= BPF_DESIGN_GRID; k++) {
        float f = (fs * 0.5f) * (float)k / (float)BPF_DESIGN_GRID;
        target[k] = 0.0f;
        if (f >= lo && f <= hi) {
            target[k] = powf(10.0f, (tiltDb * (f - markHz) / (spaceHz - markHz)) / 20.0f);
            if (k == 0 || k == BPF_DESIGN_GRID)
                target[k] *= 0.5f;
        }
    }

    for (int n = 0; n < taps; n++) {
        float acc = 0.0f;
        for (int k = 0; k <= BPF_DESIGN_GRID; k++) {
            if (target[k] == 0.0f)
                continue;
            float f = (fs * 0.5f) * (float)k / (float)BPF_DESIGN_GRID;
            acc += target[k] * cosf(2.0f * (float)M_PI * f * (float)(n - m) / fs);
        }
        float window = 0.54f - 0.46f * cosf(2.0f * (float)M_PI * (float)n / (float)(taps - 1));
        h[n] = acc / (float)BPF_DESIGN_GRID * window;
    }

    float peak = 0.0f;
    for (int k = 0; k <= BPF_DESIGN_GRID; k++) {
        float f = (fs * 0.5f) * (float)k / (float)BPF_DESIGN_GRID;
        float re = 0.0f, im = 0.0f;
        for (int n = 0; n < taps; n++) {
            float w = 2.0f * (float)M_PI * f * (float)n / fs;
            re += h[n] * cosf(w);
            im -= h[n] * sinf(w);
        }
        float g = sqrtf(re * re + im * im);
        if (g > peak)
            peak = g;
    }
    if (!(peak > 0.0f))
        peak = 1.0f;

