hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/modem.c
    for (int n = 0; n < taps; n++)
        out[n] = (int16_t)lrintf(h[n] / peak * 32767.0f);
}

// @brief Common clock-recovery and DCD settings of the 1200 Bd demodulators.
static void setup1200Demod(struct DemodState *dem) {
    dem->pllStep = calibratedPllStep(PLL1200_STEP);
    dem->pllLockedTune = (int32_t)(PLL1200_LOCKED_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));
    dem->pllNotLockedTune = (int32_t)(PLL1200_NOT_LOCKED_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));
    dem->dcdMax = DCD1200_MAXPULSE;
    dem->dcdThres = DCD1200_THRES;
    dem->dcdInc = DCD1200_INC;
    dem->dcdDec = DCD1200_DEC;
    dem->dcdTune = (int32_t)(DCD1200_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));
    dem->lpf.coeffs = lpf1200;
    dem->lpf.taps = sizeof(lpf1200) / sizeof(*lpf1200);
    dem->lpf.gainShift = 15;
    dem->prefilter = PREFILTER_NONE;
}

// @brief Attach a prefilter to a demodulator and record its tilt.
static void setPrefilter(struct DemodState *dem, const int16_t *coeffs, uint8_t taps, uint8_t gainShift) {
    dem->prefilter = PREFILTER_BANDPASS;
    dem->bpf.coeffs = coeffs;
    dem->bpf.taps = taps;
    dem->bpf.gainShift = gainShift;

    float gMark = firGain(coeffs, taps, markFreq, (float)MODEM_DEMOD_SAMPLERATE);
    float gSpace = firGain(coeffs, taps, spaceFreq, (float)MODEM_DEMOD_SAMPLERATE);
    dem->bpfTiltDb = (gMark > 0.0f && gSpace > 0.0f) ? 20.0f * log10f(gSpace / gMark) : 0.0f;
}

// @brief Build the 1200 Bd demodulator set selected by rxTuning.
static void setup1200DemodSet(void) {
    const int8_t *tilts = NULL;

    switch (rxTuning.eq_preset) {
        case MODEM_RX_EQ_LEGACY:
            demodCount = 2;
            break;
        case MODEM_RX_EQ_SINGLE:
            demodCount = 1;
            tilts = ModemConfig.flatAudioIn ? tiltSingleFlat : tiltSingleSpeaker;
            break;
        case MODEM_RX_EQ_DIVERSITY2:
            demodCount = 2;
            tilts = ModemConfig.flatAudioIn ? tiltDiv2Flat : tiltDiv2Speaker;
            break;
        case MODEM_RX_EQ_CUSTOM:
            demodCount = rxTuning.custom_count;
            tilts = rxTuning.custom_tilt_db;
            break;
        case MODEM_RX_EQ_DIVERSITY3:
        default:
            demodCount = 3;
            tilts = ModemConfig.flatAudioIn ? tiltDiv3Flat : tiltDiv3Speaker;
            break;
    }

    for (uint8_t i = 0; i < demodCount; i++)
        setup1200Demod(&demodState[i]);

    if (tilts == NULL) {
        // Legacy set: demodulator 0 runs a fixed band-pass matched to the kind
        // of input, demodulator 1 sees the input unfiltered.
        if (ModemConfig.flatAudioIn)
            setPrefilter(&demodState[0], bpf1200Level, sizeof(bpf1200Level) / sizeof(*bpf1200Level), 15);
        else
            setPrefilter(&demodState[0], bpf1200Tilted, sizeof(bpf1200Tilted) / sizeof(*bpf1200Tilted), 15);
        return;
    }

    for (uint8_t i = 0; i < demodCount; i++) {
        struct DemodState *dem = &demodState[i];

        designPrefilter(dem->bpfTable, rxTuning.bpf_taps, (float)MODEM_DEMOD_SAMPLERATE, (float)rxTuning.bpf_lo_hz, (float)rxTuning.bpf_hi_hz, markFreq,
                        spaceFreq, (float)tilts[i]);
        setPrefilter(dem, dem->bpfTable, rxTuning.bpf_taps, 15);
        ESP_LOGI(TAG, "demod %u: band-pass %u-%u Hz, %u taps, tilt %+d dB requested, %+.1f dB realized", (unsigned)i, (unsigned)rxTuning.bpf_lo_hz,
                 (unsigned)rxTuning.bpf_hi_hz, (unsigned)rxTuning.bpf_taps, (int)tilts[i], (double)dem->bpfTiltDb);
    }
}

void ModemInit(void) {
    memset(demodState, 0, sizeof(demodState));

    if (ModemConfig.modem > MODEM_MODEM_G3RUH)
        ModemConfig.modem = MODEM_MODEM_BELL202;

    // Receive clock correction for this profile: the ADC error for every
    // station on the air, plus the DAC error when the receiver hears this
    // node's own G3RUH transmitter (see ModemCalibrateSampleRate()).
    rxRateCorrection = adcRateRatio;
    if ((ModemConfig.modem == MODEM_MODEM_G3RUH) && afskGetFullDuplex())
        rxRateCorrection = adcRateRatio / dacRateRatio;

    if ((ModemConfig.modem == MODEM_MODEM_BELL202) || (ModemConfig.modem == MODEM_MODEM_V23)) {
        N = N1200;
        baudRate = 1200.f;

        if (ModemConfig.modem == MODEM_MODEM_BELL202) { // Bell 202
            markFreq = 1200.f;
            spaceFreq = 2200.f;
        } else { // V.23
            markFreq = 1300.f;
            spaceFreq = 2100.f;
        }

        setup1200DemodSet();
    } else if (ModemConfig.modem == MODEM_MODEM_AFSK300) {
        demodCount = 1;
        N = N300;
        baudRate = 300.f;
        markFreq = 1600.f;
        spaceFreq = 1800.f;

        demodState[0].pllStep = calibratedPllStep(PLL300_STEP);
        demodState[0].pllLockedTune = (int32_t)(PLL300_LOCKED_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));
        demodState[0].pllNotLockedTune = (int32_t)(PLL300_NOT_LOCKED_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));
        demodState[0].dcdMax = DCD300_MAXPULSE;
        demodState[0].dcdThres = DCD300_THRES;
        demodState[0].dcdInc = DCD300_INC;
        demodState[0].dcdDec = DCD300_DEC;
        demodState[0].dcdTune = (int32_t)(DCD300_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));

        setPrefilter(&demodState[0], bpf300, sizeof(bpf300) / sizeof(*bpf300), 16);
        demodState[0].lpf.coeffs = lpf300;
        demodState[0].lpf.taps = sizeof(lpf300) / sizeof(*lpf300);
        demodState[0].lpf.gainShift = 15;
    } else if (ModemConfig.modem == MODEM_MODEM_G3RUH) {
        demodCount = 1;
        N = N9600;
        baudRate = 9600.f;

        // G3RUH is baseband NRZ, not AFSK: there are no mark and space tones,
        // so both are reported as 0. The tone-reporting helpers must not
        // claim a mark or space frequency for a profile that emits neither.
        markFreq = 0.f;
        spaceFreq = 0.f;

        demodState[0].pllStep = calibratedPllStep(PLL9600_STEP);
        demodState[0].pllLockedTune = (int32_t)(PLL9600_LOCKED_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));
        demodState[0].pllNotLockedTune = (int32_t)(PLL9600_NOT_LOCKED_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));
        demodState[0].dcdMax = DCD9600_MAXPULSE;
        demodState[0].dcdThres = DCD9600_THRES;
        demodState[0].dcdInc = DCD9600_INC;
        demodState[0].dcdDec = DCD9600_DEC;
        demodState[0].dcdTune = (int32_t)(DCD9600_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));

        demodState[0].prefilter = PREFILTER_NONE;
        // Receive only. Nothing on the TX path runs it -
        // MODEM_BAUDRATE_TIMER_HANDLER() emits a raw 240/20 square - and it
        // should stay that way: shaping the transmitter with this same filter
        // was measured on the host to roughly double the BER, because the TX+RX
        // cascade closes the eye. If transmit shaping is ever wanted it needs
        // its own, wider filter and its own state (the receiver is using this
        // instance concurrently in full duplex).
        demodState[0].lpf.coeffs = lpf9600;
        demodState[0].lpf.taps = sizeof(lpf9600) / sizeof(*lpf9600);
        demodState[0].lpf.gainShift = 16;
    }

    // Transmit steps. The tones and the AFSK symbol phase are built from the
    // real DAC alarm rate, so what goes on the air is exact; before the DAC
    // timer exists the nominal rate stands in. G3RUH's whole-sample symbol
    // length comes from the nominal rate, which is an exact multiple of its
    // baud rate.
    uint32_t dacRate = afskGetDacSampleRate();
    txRateHz = afskGetDacAlarmRate();
    if (!(txRateHz > 0.0f))
        txRateHz = (float)dacRate;

    markStep = (uint32_t)(((double)markFreq * 4294967296.0) / (double)txRateHz + 0.5);
    spaceStep = (uint32_t)(((double)spaceFreq * 4294967296.0) / (double)txRateHz + 0.5);
    baudPhaseStep = (uint32_t)(((double)baudRate * 4294967296.0) / (double)txRateHz + 0.5);
    baudRateStep = (uint16_t)(dacRate / (uint32_t)baudRate);

    {
        float txMark = 0, txSpace = 0;
        ModemGetStepTones(&txMark, &txSpace);
        ESP_LOGI(TAG, "mark %.1f Hz -> emits %.2f, space %.1f Hz -> emits %.2f, DAC %.1f Hz, %u demodulator(s), RX clock correction %+.3f%%", markFreq, txMark,
                 spaceFreq, txSpace, (double)txRateHz, (unsigned)demodCount, (double)((rxRateCorrection - 1.0f) * 100.0f));
    }

    for (uint8_t i = 0; i < N; i++) { // correlator coefficients
        coeffLoI[i] = (int16_t)(4095.f * cosf(2.f * (float)M_PI * (float)i / (float)N * markFreq / baudRate));
        coeffLoQ[i] = (int16_t)(4095.f * sinf(2.f * (float)M_PI * (float)i / (float)N * markFreq / baudRate));
        coeffHiI[i] = (int16_t)(4095.f * cosf(2.f * (float)M_PI * (float)i / (float)N * spaceFreq / baudRate));
        coeffHiQ[i] = (int16_t)(4095.f * sinf(2.f * (float)M_PI * (float)i / (float)N * spaceFreq / baudRate));
    }

    // reset the modulator state
    phaseAcc = 0;
    baudPhase = 0;
    sampleIndex = baudRateStep;
    symbolDue = true;
    currentSymbol = 0;
    scrambledSymbol = 0;
    txLfsr = 0x1FFFF;
    rxLfsr = 0x1FFFF;
    dcd = 0;
}
